Semester-7/Технология разработки прикладных решений 1С/lab3/src/DataProcessors/СервисныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>СервисныеОперации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab3/src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab3/src/DataProcessors/СервисныеОперации/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка «Сервисные операции».
//
// Команды соответствуют разделам части 2 учебного пособия Семёнова,
// доработки — заданиям 3–9 курса. Имена серверных процедур совпадают
// с теми, что фигурируют в формулировках заданий.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедуры

&НаКлиенте
Функция КатегорияУказана()

	Если НЕ ЗначениеЗаполнено(КатегорияТоваров) Тогда
		Сообщить("Укажите категорию товаров.");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ЗаменаЦветаИСтраны

// Задание 3. Цвет заменяется только у товаров выбранной категории.
// В поле выбора категории разрешён выбор только групп, элемент указать нельзя.
&НаСервереБезКонтекста
Процедура ЗаменаЦветаНаСервере(Категория)

	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
	Заменено = 0;

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(ВыборкаТоваров.ЦветТовара) = "Зеленый" Тогда
			ТекущийТовар = ВыборкаТоваров.Ссылка.ПолучитьОбъект();
			ТекущийТовар.ЦветТовара = Справочники.ЦветаТоваров.НайтиПоКоду("Красный");
			ТекущийТовар.Записать();
			Заменено = Заменено + 1;
			Сообщить("Для товара " + ТекущийТовар.Наименование + " заменен зеленый цвет на красный.");
		КонецЕсли;
	КонецЦикла;

	Если Заменено = 0 Тогда
		Сообщить("В категории " + Категория + " товаров зелёного цвета не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаЦвета(Команда)

	Если КатегорияУказана() Тогда
		ЗаменаЦветаНаСервере(КатегорияТоваров);
	КонецЕсли;

КонецПроцедуры

// Задание 3. Страна заменяется только у товаров выбранной категории.
&НаСервереБезКонтекста
Процедура ЗаменаСтраныНаСервере(Категория)

	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
	Заменено = 0;

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(ВыборкаТоваров.СтранаТовара) = "Китай" Тогда
			ТекущийТовар = ВыборкаТоваров.Ссылка.ПолучитьОбъект();
			ТекущийТовар.СтранаТовара = Справочники.СтраныТоваров.НайтиПоКоду("Россия");
			ТекущийТовар.Записать();
			Заменено = Заменено + 1;
			Сообщить("Для товара " + ТекущийТовар.Наименование + " заменена страна Китай на Россию.");
		КонецЕсли;
	КонецЦикла;

	Если Заменено = 0 Тогда
		Сообщить("В категории " + Категория + " товаров из Китая не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаСтраны(Команда)

	Если КатегорияУказана() Тогда
		ЗаменаСтраныНаСервере(КатегорияТоваров);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
